<!-- dflook/terraform-github-actions {"workspace":"organization-config","backend_type":"remote","backend":"8e13e9a62fa239bbf8e77cb28edc88807fd21e27569c0c65f71a7910de0ef6f7","plan_job_ref":"Job Review #16 at https://github.com/block-o/organization-config/actions/runs/18314354639","plan_out_hash":"8d8a131005a394a755e4d3acabb2ad0b031256c9adf449a64b6e2eb5380ce5b2","plan_hash":"554f13942d40205700be06f6ef112cde00716bd80a1583cb1d70dd57b417c2ce","plan_text_format":"diff","version":"2.2.2"} -->
OpenTofu plan in __.__ in the __organization-config__ workspace
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # github_branch_protection.main[".github"] will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           require_last_push_approval      = false
+           required_approving_review_count = 0
        }

+       required_status_checks {
+           strict = true
        }
    }

  # github_branch_protection.main["operator"] will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           require_last_push_approval      = false
+           required_approving_review_count = 0
        }

+       required_status_checks {
+           strict = true
        }
    }

  # github_repository.repositories[".github"] will be created
+   resource "github_repository" "repositories" {
+       allow_auto_merge            = true
+       allow_merge_commit          = false
+       allow_rebase_merge          = false
+       allow_squash_merge          = true
+       archive_on_destroy          = true
+       archived                    = false
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = false
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = ".github"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "github",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true

+       security_and_analysis {
+           secret_scanning {
+               status = "enabled"
            }
+           secret_scanning_push_protection {
+               status = "enabled"
            }
        }
    }

  # github_repository.repositories["operator"] will be created
+   resource "github_repository" "repositories" {
+       allow_auto_merge            = true
+       allow_merge_commit          = false
+       allow_rebase_merge          = false
+       allow_squash_merge          = true
+       archive_on_destroy          = true
+       archived                    = false
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "A Kubernetes Operator that provisions and manages blockchain nodes (e.g., Bitcoin/bcoin, Ethereum/geth) via CRDs."
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "operator"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "go",
+           "kubernetes",
        ]
+       visibility                  = "private"
+       vulnerability_alerts        = true

+       security_and_analysis {
+           advanced_security {
+               status = "enabled"
            }
+           secret_scanning {
+               status = "enabled"
            }
+           secret_scanning_push_protection {
+               status = "enabled"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Review #16](https://github.com/block-o/organization-config/actions/runs/18314354639)